{"Alexandra Martynova-Van Kley":"Alexandra Martynova-Van Kley is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n55 years and his\/her work has been cited for a total of 1668 times.\nWith a H-index of 12.0 he\/she has published a total of 21 papers. \nHe\/she has attened 11 events and have recieved scholarships \nand grant worth 672908.","Ashley Elias":"Ashley Elias is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n0 years and his\/her work has been cited for a total of 0 times.\nWith a H-index of 0.0 he\/she has published a total of 1 papers. \nHe\/she has attened 22 events and have recieved scholarships \nand grant worth 1356262.","BARRY G. ROBINSON":"BARRY G. ROBINSON is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n4 years and his\/her work has been cited for a total of 98 times.\nWith a H-index of 4.0 he\/she has published a total of 5 papers. \nHe\/she has attened 2 events and have recieved scholarships \nand grant worth 174435.","BRIAN BECKAGE ":"BRIAN BECKAGE  is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n22 years and his\/her work has been cited for a total of 2870 times.\nWith a H-index of 29.0 he\/she has published a total of 62 papers. \nHe\/she has attened 2 events and have recieved scholarships \nand grant worth 62311469.","CARMEN G. MONTAÑA-SCHALK":"CARMEN G. MONTAÑA-SCHALK is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \nnan years and his\/her work has been cited for a total of nan times.\nWith a H-index of nan he\/she has published a total of nan papers. \nHe\/she has attened 34 events and have recieved scholarships \nand grant worth 782753.","Caroline (Lina) Lund Dahlberg":"Caroline (Lina) Lund Dahlberg is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n18 years and his\/her work has been cited for a total of 324 times.\nWith a H-index of 7.0 he\/she has published a total of 12 papers. \nHe\/she has attened 9 events and have recieved scholarships \nand grant worth 0.","CHRISTOPHER LEONARD BRETT":"CHRISTOPHER LEONARD BRETT is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n50 years and his\/her work has been cited for a total of 1987 times.\nWith a H-index of 20.0 he\/she has published a total of 42 papers. \nHe\/she has attened 22 events and have recieved scholarships \nand grant worth 3488191.","DANIEL J. BENNETT":"DANIEL J. BENNETT is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n3 years and his\/her work has been cited for a total of 37 times.\nWith a H-index of 3.0 he\/she has published a total of 18 papers. \nHe\/she has attened 1 events and have recieved scholarships \nand grant worth 28931.","DENIS A. LAROCHELLE":"DENIS A. LAROCHELLE is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n37 years and his\/her work has been cited for a total of 700 times.\nWith a H-index of 12.0 he\/she has published a total of 38 papers. \nHe\/she has attened 11 events and have recieved scholarships \nand grant worth 959307.","DENNIS A. GRAVATT":"DENNIS A. GRAVATT is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n0 years and his\/her work has been cited for a total of 0 times.\nWith a H-index of 0.0 he\/she has published a total of 1 papers. \nHe\/she has attened 11 events and have recieved scholarships \nand grant worth 146118080.","Dior R. Kelley":"Dior R. Kelley is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n65 years and his\/her work has been cited for a total of 1199 times.\nWith a H-index of 17.0 he\/she has published a total of 49 papers. \nHe\/she has attened 12 events and have recieved scholarships \nand grant worth 69617.","Easton R. White":"Easton R. White is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n8 years and his\/her work has been cited for a total of 709 times.\nWith a H-index of 13.0 he\/she has published a total of 40 papers. \nHe\/she has attened 2 events and have recieved scholarships \nand grant worth 2221001.","Eric Stabb":"Eric Stabb is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n26 years and his\/her work has been cited for a total of 5788 times.\nWith a H-index of 37.0 he\/she has published a total of 82 papers. \nHe\/she has attened 16 events and have recieved scholarships \nand grant worth 3531681.","Heidi J Gill Super":"Heidi J Gill Super is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n28 years and his\/her work has been cited for a total of 3288 times.\nWith a H-index of 25.0 he\/she has published a total of 86 papers. \nHe\/she has attened 17 events and have recieved scholarships \nand grant worth 618335.","JASON N. BRUCK":"JASON N. BRUCK is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n10 years and his\/her work has been cited for a total of 76 times.\nWith a H-index of 3.0 he\/she has published a total of 4 papers. \nHe\/she has attened 4 events and have recieved scholarships \nand grant worth 1456259.","JENNIFER M. BHATNAGAR":"JENNIFER M. BHATNAGAR is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n14 years and his\/her work has been cited for a total of 3764 times.\nWith a H-index of 25.0 he\/she has published a total of 87 papers. \nHe\/she has attened 12 events and have recieved scholarships \nand grant worth 5939536.","John J. Ewel":"John J. Ewel is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n37 years and his\/her work has been cited for a total of 23273 times.\nWith a H-index of 52.0 he\/she has published a total of 152 papers. \nHe\/she has attened 5 events and have recieved scholarships \nand grant worth 0.","John M. Schmitt":"John M. Schmitt is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n45 years and his\/her work has been cited for a total of 655 times.\nWith a H-index of 12.0 he\/she has published a total of 51 papers. \nHe\/she has attened 15 events and have recieved scholarships \nand grant worth 0.","JOHN SAKULICH":"JOHN SAKULICH is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n16 years and his\/her work has been cited for a total of 395 times.\nWith a H-index of 8.0 he\/she has published a total of 15 papers. \nHe\/she has attened 5 events and have recieved scholarships \nand grant worth 20268.","JOSEPH PETER MONTOYA":"JOSEPH PETER MONTOYA is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n26 years and his\/her work has been cited for a total of 8224 times.\nWith a H-index of 47.0 he\/she has published a total of 96 papers. \nHe\/she has attened 80 events and have recieved scholarships \nand grant worth 2100516.","Kimberly L. Mowry":"Kimberly L. Mowry is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n39 years and his\/her work has been cited for a total of 2403 times.\nWith a H-index of 24.0 he\/she has published a total of 47 papers. \nHe\/she has attened 52 events and have recieved scholarships \nand grant worth 0.","LAURA J. OLSEN":"LAURA J. OLSEN is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n18 years and his\/her work has been cited for a total of 350 times.\nWith a H-index of 6.0 he\/she has published a total of 25 papers. \nHe\/she has attened 2 events and have recieved scholarships \nand grant worth 1133488.","Lindsay M. Porter":"Lindsay M. Porter is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n21 years and his\/her work has been cited for a total of 280 times.\nWith a H-index of 11.0 he\/she has published a total of 20 papers. \nHe\/she has attened 17 events and have recieved scholarships \nand grant worth 73975.","Matthew A. Kwiatkowsk":"Matthew A. Kwiatkowsk is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \nnan years and his\/her work has been cited for a total of nan times.\nWith a H-index of nan he\/she has published a total of nan papers. \nHe\/she has attened 21 events and have recieved scholarships \nand grant worth 581541.","Michael E. Burns":"Michael E. Burns is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n13 years and his\/her work has been cited for a total of 934 times.\nWith a H-index of 19.0 he\/she has published a total of 84 papers. \nHe\/she has attened 17 events and have recieved scholarships \nand grant worth 1299026.","Michael I. Coates":"Michael I. Coates is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n31 years and his\/her work has been cited for a total of 6412 times.\nWith a H-index of 42.0 he\/she has published a total of 135 papers. \nHe\/she has attened 0 events and have recieved scholarships \nand grant worth 0.","Nathan J Sanders":"Nathan J Sanders is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n100 years and his\/her work has been cited for a total of 162 times.\nWith a H-index of 4.0 he\/she has published a total of 21 papers. \nHe\/she has attened 12 events and have recieved scholarships \nand grant worth 9042869.","STEPHANIE J.B. FRETHAM":"STEPHANIE J.B. FRETHAM is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n10 years and his\/her work has been cited for a total of 639 times.\nWith a H-index of 12.0 he\/she has published a total of 13 papers. \nHe\/she has attened 18 events and have recieved scholarships \nand grant worth 102426.","Stephen Wagner":"Stephen Wagner is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n25 years and his\/her work has been cited for a total of 17812 times.\nWith a H-index of 43.0 he\/she has published a total of 208 papers. \nHe\/she has attened 0 events and have recieved scholarships \nand grant worth 811052.","WILLIAM I. LUTTERSCHMIDT":"WILLIAM I. LUTTERSCHMIDT is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n28 years and his\/her work has been cited for a total of 2218 times.\nWith a H-index of 18.0 he\/she has published a total of 87 papers. \nHe\/she has attened 13 events and have recieved scholarships \nand grant worth 106451613.","William R. McCleary":"William R. McCleary is a reasearcher who work in the field of Biology. \nHe\/she is a researcher who is active in this field for the past \n31 years and his\/her work has been cited for a total of 2900 times.\nWith a H-index of 20.0 he\/she has published a total of 27 papers. \nHe\/she has attened 13 events and have recieved scholarships \nand grant worth 1001500.","ALEXANDROS MAKRIYANNIS":"ALEXANDROS MAKRIYANNIS is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n27 years and his\/her work has been cited for a total of 32683 times.\nWith a H-index of 93.0 he\/she has published a total of 822 papers. \nHe\/she has attened 84 events and have recieved scholarships \nand grant worth 0.","Alison Flynn":"Alison Flynn is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n15 years and his\/her work has been cited for a total of 1730 times.\nWith a H-index of 22.0 he\/she has published a total of 74 papers. \nHe\/she has attened 42 events and have recieved scholarships \nand grant worth 0.","ANDREI TOKMAKOFF":"ANDREI TOKMAKOFF is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n28 years and his\/her work has been cited for a total of 17540 times.\nWith a H-index of 73.0 he\/she has published a total of 273 papers. \nHe\/she has attened 3 events and have recieved scholarships \nand grant worth 0.","André M. Beauchemin":"André M. Beauchemin is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n18 years and his\/her work has been cited for a total of 1680 times.\nWith a H-index of 25.0 he\/she has published a total of 49 papers. \nHe\/she has attened 8 events and have recieved scholarships \nand grant worth 0.","Arthur Bragg":"Arthur Bragg is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n19 years and his\/her work has been cited for a total of 3182 times.\nWith a H-index of 27.0 he\/she has published a total of 93 papers. \nHe\/she has attened 6 events and have recieved scholarships \nand grant worth 0.","Bing Xu":"Bing Xu is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n6 years and his\/her work has been cited for a total of 50495 times.\nWith a H-index of 12.0 he\/she has published a total of 14 papers. \nHe\/she has attened 1 events and have recieved scholarships \nand grant worth 0.","C. Dale Keefe":"C. Dale Keefe is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n30 years and his\/her work has been cited for a total of 1237 times.\nWith a H-index of 22.0 he\/she has published a total of 59 papers. \nHe\/she has attened 12 events and have recieved scholarships \nand grant worth 2695673.","Carlos Velazquez-Martinez":"Carlos Velazquez-Martinez is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n8 years and his\/her work has been cited for a total of 507 times.\nWith a H-index of 13.0 he\/she has published a total of 24 papers. \nHe\/she has attened 21 events and have recieved scholarships \nand grant worth 480000.","Cathleen Crudden":"Cathleen Crudden is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n22 years and his\/her work has been cited for a total of 9221 times.\nWith a H-index of 53.0 he\/she has published a total of 213 papers. \nHe\/she has attened 66 events and have recieved scholarships \nand grant worth 27666586.","Cecilia I. Zurita Lopez":"Cecilia I. Zurita Lopez is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n15 years and his\/her work has been cited for a total of 1216 times.\nWith a H-index of 14.0 he\/she has published a total of 25 papers. \nHe\/she has attened 9 events and have recieved scholarships \nand grant worth 1928199.","Charles E. Jakobsche":"Charles E. Jakobsche is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n16 years and his\/her work has been cited for a total of 493 times.\nWith a H-index of 8.0 he\/she has published a total of 21 papers. \nHe\/she has attened 3 events and have recieved scholarships \nand grant worth 204234.","Chng Shu Sin":"Chng Shu Sin is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n19 years and his\/her work has been cited for a total of 2190 times.\nWith a H-index of 21.0 he\/she has published a total of 33 papers. \nHe\/she has attened 15 events and have recieved scholarships \nand grant worth 735050300.","Christine M. Rolland de Denus":"Christine M. Rolland de Denus is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \nnan years and his\/her work has been cited for a total of nan times.\nWith a H-index of nan he\/she has published a total of nan papers. \nHe\/she has attened 16 events and have recieved scholarships \nand grant worth 2000996.","Clément Pierre Bataille":"Clément Pierre Bataille is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n6 years and his\/her work has been cited for a total of 484 times.\nWith a H-index of 9.0 he\/she has published a total of 30 papers. \nHe\/she has attened 10 events and have recieved scholarships \nand grant worth 2227500.","Curtis Berlinguette":"Curtis Berlinguette is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n18 years and his\/her work has been cited for a total of 12112 times.\nWith a H-index of 57.0 he\/she has published a total of 240 papers. \nHe\/she has attened 2 events and have recieved scholarships \nand grant worth 0.","Danielle H. Dube":"Danielle H. Dube is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n36 years and his\/her work has been cited for a total of 3083 times.\nWith a H-index of 22.0 he\/she has published a total of 75 papers. \nHe\/she has attened 34 events and have recieved scholarships \nand grant worth 786434.","Deryn Fogg":"Deryn Fogg is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n25 years and his\/her work has been cited for a total of 6364 times.\nWith a H-index of 43.0 he\/she has published a total of 141 papers. \nHe\/she has attened 77 events and have recieved scholarships \nand grant worth 3737510543.","FRASER F. FLEMING":"FRASER F. FLEMING is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n25 years and his\/her work has been cited for a total of 4184 times.\nWith a H-index of 27.0 he\/she has published a total of 150 papers. \nHe\/she has attened 8 events and have recieved scholarships \nand grant worth 4535773.","Glenn Christopher Micalizio":"Glenn Christopher Micalizio is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n19 years and his\/her work has been cited for a total of 2156 times.\nWith a H-index of 30.0 he\/she has published a total of 92 papers. \nHe\/she has attened 16 events and have recieved scholarships \nand grant worth 5562423.","Gregory J. Smith":"Gregory J. Smith is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n38 years and his\/her work has been cited for a total of 1265 times.\nWith a H-index of 16.0 he\/she has published a total of 58 papers. \nHe\/she has attened 4 events and have recieved scholarships \nand grant worth 7620.","Gregory K. Friestad":"Gregory K. Friestad is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n23 years and his\/her work has been cited for a total of 2945 times.\nWith a H-index of 29.0 he\/she has published a total of 91 papers. \nHe\/she has attened 13 events and have recieved scholarships \nand grant worth 0.","Gregory R. Bowman":"Gregory R. Bowman is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n13 years and his\/her work has been cited for a total of 8081 times.\nWith a H-index of 43.0 he\/she has published a total of 83 papers. \nHe\/she has attened 31 events and have recieved scholarships \nand grant worth 0.","Henry S. White":"Henry S. White is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n58 years and his\/her work has been cited for a total of 9248 times.\nWith a H-index of 54.0 he\/she has published a total of 238 papers. \nHe\/she has attened 86 events and have recieved scholarships \nand grant worth 0.","Ivan Julian Dmochowski":"Ivan Julian Dmochowski is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n22 years and his\/her work has been cited for a total of 3615 times.\nWith a H-index of 38.0 he\/she has published a total of 174 papers. \nHe\/she has attened 47 events and have recieved scholarships \nand grant worth 6464908.","J. Martin Scholtz":"J. Martin Scholtz is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n29 years and his\/her work has been cited for a total of 15931 times.\nWith a H-index of 53.0 he\/she has published a total of 121 papers. \nHe\/she has attened 67 events and have recieved scholarships \nand grant worth 7.","James Wallace Herndon, Jr.":"James Wallace Herndon, Jr. is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n39 years and his\/her work has been cited for a total of 3012 times.\nWith a H-index of 32.0 he\/she has published a total of 185 papers. \nHe\/she has attened 72 events and have recieved scholarships \nand grant worth 5750289.","Jason Gilmore":"Jason Gilmore is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n23 years and his\/her work has been cited for a total of 395 times.\nWith a H-index of 12.0 he\/she has published a total of 49 papers. \nHe\/she has attened 16 events and have recieved scholarships \nand grant worth 4172856.","Jennifer D. Adams":"Jennifer D. Adams is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n13 years and his\/her work has been cited for a total of 879 times.\nWith a H-index of 16.0 he\/she has published a total of 83 papers. \nHe\/she has attened 4 events and have recieved scholarships \nand grant worth 9850523.","Jimmy Blair":"Jimmy Blair is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n22 years and his\/her work has been cited for a total of 49213 times.\nWith a H-index of 106.0 he\/she has published a total of 380 papers. \nHe\/she has attened 2 events and have recieved scholarships \nand grant worth 97684.","Julian Chan":"Julian Chan is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n18 years and his\/her work has been cited for a total of 2349 times.\nWith a H-index of 28.0 he\/she has published a total of 56 papers. \nHe\/she has attened 8 events and have recieved scholarships \nand grant worth 1357799.","Karin S. Åkerfeldt":"Karin S. Åkerfeldt is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n42 years and his\/her work has been cited for a total of 1251 times.\nWith a H-index of 15.0 he\/she has published a total of 57 papers. \nHe\/she has attened 0 events and have recieved scholarships \nand grant worth 281.","Katharina M. Fromm":"Katharina M. Fromm is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n23 years and his\/her work has been cited for a total of 10511 times.\nWith a H-index of 43.0 he\/she has published a total of 320 papers. \nHe\/she has attened 4 events and have recieved scholarships \nand grant worth 140000.","Kimberley A. Frederick":"Kimberley A. Frederick is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n30 years and his\/her work has been cited for a total of 280 times.\nWith a H-index of 10.0 he\/she has published a total of 39 papers. \nHe\/she has attened 57 events and have recieved scholarships \nand grant worth 2069030.","KRIJN DE JONG":"KRIJN DE JONG is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n49 years and his\/her work has been cited for a total of 241 times.\nWith a H-index of 7.0 he\/she has published a total of 8 papers. \nHe\/she has attened 5 events and have recieved scholarships \nand grant worth 0.","Liliya A. Yatsunyk ":"Liliya A. Yatsunyk  is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \nnan years and his\/her work has been cited for a total of nan times.\nWith a H-index of nan he\/she has published a total of nan papers. \nHe\/she has attened 101 events and have recieved scholarships \nand grant worth 1386963.","Malika Jeffries-EL":"Malika Jeffries-EL is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n17 years and his\/her work has been cited for a total of 3766 times.\nWith a H-index of 27.0 he\/she has published a total of 92 papers. \nHe\/she has attened 20 events and have recieved scholarships \nand grant worth 961672.","Maria Ngu-Schwemlein":"Maria Ngu-Schwemlein is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n28 years and his\/her work has been cited for a total of 422 times.\nWith a H-index of 9.0 he\/she has published a total of 45 papers. \nHe\/she has attened 37 events and have recieved scholarships \nand grant worth 88633.","Matt F. Simcik":"Matt F. Simcik is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n24 years and his\/her work has been cited for a total of 4643 times.\nWith a H-index of 24.0 he\/she has published a total of 42 papers. \nHe\/she has attened 14 events and have recieved scholarships \nand grant worth 0.","Matthew L. Miller":"Matthew L. Miller is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n20 years and his\/her work has been cited for a total of 1558 times.\nWith a H-index of 16.0 he\/she has published a total of 47 papers. \nHe\/she has attened 36 events and have recieved scholarships \nand grant worth 1202119.","Michael A. Brook":"Michael A. Brook is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n22 years and his\/her work has been cited for a total of 20387 times.\nWith a H-index of 59.0 he\/she has published a total of 213 papers. \nHe\/she has attened 34 events and have recieved scholarships \nand grant worth 0.","Michael Organ":"Michael Organ is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n26 years and his\/her work has been cited for a total of 13392 times.\nWith a H-index of 55.0 he\/she has published a total of 253 papers. \nHe\/she has attened 125 events and have recieved scholarships \nand grant worth 326207407.","Nicolai Lehnert":"Nicolai Lehnert is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n22 years and his\/her work has been cited for a total of 8820 times.\nWith a H-index of 50.0 he\/she has published a total of 251 papers. \nHe\/she has attened 38 events and have recieved scholarships \nand grant worth 0.","P. Shiv Halasyamani":"P. Shiv Halasyamani is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n23 years and his\/her work has been cited for a total of 14630 times.\nWith a H-index of 68.0 he\/she has published a total of 306 papers. \nHe\/she has attened 4 events and have recieved scholarships \nand grant worth 0.","Paul Mayer":"Paul Mayer is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n22 years and his\/her work has been cited for a total of 4749 times.\nWith a H-index of 34.0 he\/she has published a total of 144 papers. \nHe\/she has attened 13 events and have recieved scholarships \nand grant worth 0.","Peter B. Dervan":"Peter B. Dervan is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n25 years and his\/her work has been cited for a total of 29703 times.\nWith a H-index of 89.0 he\/she has published a total of 419 papers. \nHe\/she has attened 109 events and have recieved scholarships \nand grant worth 0.","Phillip Sharp":"Phillip Sharp is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n8 years and his\/her work has been cited for a total of 3707 times.\nWith a H-index of 14.0 he\/she has published a total of 24 papers. \nHe\/she has attened 0 events and have recieved scholarships \nand grant worth 0.","Piotr Piecuch":"Piotr Piecuch is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n28 years and his\/her work has been cited for a total of 14992 times.\nWith a H-index of 67.0 he\/she has published a total of 240 papers. \nHe\/she has attened 42 events and have recieved scholarships \nand grant worth 9543486.","Robert Campbell":"Robert Campbell is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n20 years and his\/her work has been cited for a total of 23459 times.\nWith a H-index of 61.0 he\/she has published a total of 244 papers. \nHe\/she has attened 69 events and have recieved scholarships \nand grant worth 2122814.","ROBERT H. MORRIS":"ROBERT H. MORRIS is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n34 years and his\/her work has been cited for a total of 19759 times.\nWith a H-index of 70.0 he\/she has published a total of 345 papers. \nHe\/she has attened 7 events and have recieved scholarships \nand grant worth 1459422.","ROBERT HOWARD GRUBBS":"ROBERT HOWARD GRUBBS is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n51 years and his\/her work has been cited for a total of 4905 times.\nWith a H-index of 40.0 he\/she has published a total of 445 papers. \nHe\/she has attened 2 events and have recieved scholarships \nand grant worth 0.","Roman Krems":"Roman Krems is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n21 years and his\/her work has been cited for a total of 8025 times.\nWith a H-index of 43.0 he\/she has published a total of 190 papers. \nHe\/she has attened 2 events and have recieved scholarships \nand grant worth 0.","Rudolph A. Abramovitch":"Rudolph A. Abramovitch is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n50 years and his\/her work has been cited for a total of 5849 times.\nWith a H-index of 38.0 he\/she has published a total of 256 papers. \nHe\/she has attened 13 events and have recieved scholarships \nand grant worth 0.","Ryan J. Rafferty":"Ryan J. Rafferty is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \nnan years and his\/her work has been cited for a total of nan times.\nWith a H-index of nan he\/she has published a total of nan papers. \nHe\/she has attened 13 events and have recieved scholarships \nand grant worth 0.","Sabrina Rose Leslie":"Sabrina Rose Leslie is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n13 years and his\/her work has been cited for a total of 291 times.\nWith a H-index of 10.0 he\/she has published a total of 31 papers. \nHe\/she has attened 14 events and have recieved scholarships \nand grant worth 128.","Sandra Russo-Rodriguez":"Sandra Russo-Rodriguez is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n30 years and his\/her work has been cited for a total of 0 times.\nWith a H-index of 0.0 he\/she has published a total of 2 papers. \nHe\/she has attened 1 events and have recieved scholarships \nand grant worth 5500.","Sandro Gamborotta":"Sandro Gamborotta is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \nnan years and his\/her work has been cited for a total of nan times.\nWith a H-index of nan he\/she has published a total of nan papers. \nHe\/she has attened 15 events and have recieved scholarships \nand grant worth 335412.","Scott A. Snyder":"Scott A. Snyder is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n22 years and his\/her work has been cited for a total of 10159 times.\nWith a H-index of 46.0 he\/she has published a total of 175 papers. \nHe\/she has attened 55 events and have recieved scholarships \nand grant worth 3030967.","Sherri A. Mason":"Sherri A. Mason is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n8 years and his\/her work has been cited for a total of 6329 times.\nWith a H-index of 20.0 he\/she has published a total of 41 papers. \nHe\/she has attened 13 events and have recieved scholarships \nand grant worth 13347750.","Sonya L. Caston Good":"Sonya L. Caston Good is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n34 years and his\/her work has been cited for a total of 9 times.\nWith a H-index of 1.0 he\/she has published a total of 2 papers. \nHe\/she has attened 6 events and have recieved scholarships \nand grant worth 115000.","Stefano Cesco":"Stefano Cesco is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n22 years and his\/her work has been cited for a total of 7439 times.\nWith a H-index of 48.0 he\/she has published a total of 413 papers. \nHe\/she has attened 3 events and have recieved scholarships \nand grant worth 0.","Stephen Newman":"Stephen Newman is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n18 years and his\/her work has been cited for a total of 13992 times.\nWith a H-index of 46.0 he\/she has published a total of 336 papers. \nHe\/she has attened 34 events and have recieved scholarships \nand grant worth 0.","Steve Scheiner":"Steve Scheiner is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n38 years and his\/her work has been cited for a total of 26567 times.\nWith a H-index of 83.0 he\/she has published a total of 559 papers. \nHe\/she has attened 77 events and have recieved scholarships \nand grant worth 5436147.","Steven Holdcroft":"Steven Holdcroft is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n28 years and his\/her work has been cited for a total of 19889 times.\nWith a H-index of 77.0 he\/she has published a total of 408 papers. \nHe\/she has attened 7 events and have recieved scholarships \nand grant worth 0.","Sudeep Bhattacharyay":"Sudeep Bhattacharyay is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n25 years and his\/her work has been cited for a total of 1002 times.\nWith a H-index of 17.0 he\/she has published a total of 53 papers. \nHe\/she has attened 0 events and have recieved scholarships \nand grant worth 1812361.","Tara Kahan":"Tara Kahan is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n15 years and his\/her work has been cited for a total of 1893 times.\nWith a H-index of 24.0 he\/she has published a total of 97 papers. \nHe\/she has attened 22 events and have recieved scholarships \nand grant worth 0.","Tehshik Peter Yoon":"Tehshik Peter Yoon is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n19 years and his\/her work has been cited for a total of 5668 times.\nWith a H-index of 13.0 he\/she has published a total of 80 papers. \nHe\/she has attened 44 events and have recieved scholarships \nand grant worth 0.","Thomas Baumgartner":"Thomas Baumgartner is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n17 years and his\/her work has been cited for a total of 8583 times.\nWith a H-index of 26.0 he\/she has published a total of 42 papers. \nHe\/she has attened 0 events and have recieved scholarships \nand grant worth 0.","Thomas Vogt":"Thomas Vogt is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n29 years and his\/her work has been cited for a total of 19620 times.\nWith a H-index of 64.0 he\/she has published a total of 500 papers. \nHe\/she has attened 8 events and have recieved scholarships \nand grant worth 62.","TYLER MELDRUM":"TYLER MELDRUM is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n15 years and his\/her work has been cited for a total of 454 times.\nWith a H-index of 12.0 he\/she has published a total of 28 papers. \nHe\/she has attened 11 events and have recieved scholarships \nand grant worth 1208450.","Véronique GOUVERNEUR":"Véronique GOUVERNEUR is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \nnan years and his\/her work has been cited for a total of nan times.\nWith a H-index of nan he\/she has published a total of nan papers. \nHe\/she has attened 45 events and have recieved scholarships \nand grant worth 0.","WILLIAM A. DONALDSON":"WILLIAM A. DONALDSON is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n44 years and his\/her work has been cited for a total of 2362 times.\nWith a H-index of 22.0 he\/she has published a total of 158 papers. \nHe\/she has attened 0 events and have recieved scholarships \nand grant worth 0.","William Esco Moerner":"William Esco Moerner is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n13 years and his\/her work has been cited for a total of 2490 times.\nWith a H-index of 27.0 he\/she has published a total of 208 papers. \nHe\/she has attened 14 events and have recieved scholarships \nand grant worth 0.","WILLIAM F. WACHOLTZ":"WILLIAM F. WACHOLTZ is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n30 years and his\/her work has been cited for a total of 756 times.\nWith a H-index of 12.0 he\/she has published a total of 36 papers. \nHe\/she has attened 8 events and have recieved scholarships \nand grant worth 979181.","WILLIAM M. LOFFREDO":"WILLIAM M. LOFFREDO is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \nnan years and his\/her work has been cited for a total of nan times.\nWith a H-index of nan he\/she has published a total of nan papers. \nHe\/she has attened 0 events and have recieved scholarships \nand grant worth 0.","YUAN LIU":"YUAN LIU is a reasearcher who work in the field of Chemistry. \nHe\/she is a researcher who is active in this field for the past \n11 years and his\/her work has been cited for a total of 15480 times.\nWith a H-index of 45.0 he\/she has published a total of 107 papers. \nHe\/she has attened 8 events and have recieved scholarships \nand grant worth 0.","Jacqueline E. Rice":"Jacqueline E. Rice is a reasearcher who work in the field of Computer Science. \nHe\/she is a researcher who is active in this field for the past \n19 years and his\/her work has been cited for a total of 948 times.\nWith a H-index of 17.0 he\/she has published a total of 71 papers. \nHe\/she has attened 53 events and have recieved scholarships \nand grant worth 675934.","S. Raghavan":"S. Raghavan is a reasearcher who work in the field of Computer Science. \nHe\/she is a researcher who is active in this field for the past \n20 years and his\/her work has been cited for a total of 15618 times.\nWith a H-index of 71.0 he\/she has published a total of 202 papers. \nHe\/she has attened 34 events and have recieved scholarships \nand grant worth 3475806.","Amalin Prince":"Amalin Prince is a reasearcher who work in the field of Engineering. \nHe\/she is a researcher who is active in this field for the past \n12 years and his\/her work has been cited for a total of 242 times.\nWith a H-index of 9.0 he\/she has published a total of 48 papers. \nHe\/she has attened 14 events and have recieved scholarships \nand grant worth 33479.","Arindam Sarkar":"Arindam Sarkar is a reasearcher who work in the field of Engineering. \nHe\/she is a researcher who is active in this field for the past \n16 years and his\/her work has been cited for a total of 1743 times.\nWith a H-index of 15.0 he\/she has published a total of 41 papers. \nHe\/she has attened 5 events and have recieved scholarships \nand grant worth 1407.","Jeanne Marie VanBriesen":"Jeanne Marie VanBriesen is a reasearcher who work in the field of Engineering. \nHe\/she is a researcher who is active in this field for the past \n23 years and his\/her work has been cited for a total of 7264 times.\nWith a H-index of 35.0 he\/she has published a total of 163 papers. \nHe\/she has attened 66 events and have recieved scholarships \nand grant worth 19115566.","Manjusri Misra":"Manjusri Misra is a reasearcher who work in the field of Engineering. \nHe\/she is a researcher who is active in this field for the past \n18 years and his\/her work has been cited for a total of 37137 times.\nWith a H-index of 88.0 he\/she has published a total of 818 papers. \nHe\/she has attened 0 events and have recieved scholarships \nand grant worth 20.","Brian R. Umberger":"Brian R. Umberger is a reasearcher who work in the field of Kinesiology. \nHe\/she is a researcher who is active in this field for the past \n24 years and his\/her work has been cited for a total of 1627 times.\nWith a H-index of 20.0 he\/she has published a total of 76 papers. \nHe\/she has attened 49 events and have recieved scholarships \nand grant worth 2798922.","Ben Webster":"Ben Webster is a reasearcher who work in the field of Mathematics. \nHe\/she is a researcher who is active in this field for the past \n15 years and his\/her work has been cited for a total of 1690 times.\nWith a H-index of 23.0 he\/she has published a total of 60 papers. \nHe\/she has attened 2 events and have recieved scholarships \nand grant worth 536905.","ADINA LUICAN-MAYER":"ADINA LUICAN-MAYER is a reasearcher who work in the field of Physics. \nHe\/she is a researcher who is active in this field for the past \n15 years and his\/her work has been cited for a total of 4659 times.\nWith a H-index of 17.0 he\/she has published a total of 73 papers. \nHe\/she has attened 15 events and have recieved scholarships \nand grant worth 1349000.","Andrew Leifer":"Andrew Leifer is a reasearcher who work in the field of Physics. \nHe\/she is a researcher who is active in this field for the past \n11 years and his\/her work has been cited for a total of 1812 times.\nWith a H-index of 14.0 he\/she has published a total of 16 papers. \nHe\/she has attened 2 events and have recieved scholarships \nand grant worth 620000."}